Revit 2027 API
CableTraySettings.FittingAnnotationSize Property
 The value of fitting annotation size.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FittingAnnotationSize { get; set; }
Public Property FittingAnnotationSize As Double
	Get
	Set
public:
property double FittingAnnotationSize {
	double get ();
	void set (double value);
}
member FittingAnnotationSize : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for fittingAnnotationSize must be between 0 and 30000 feet.
See Also
Reference
CableTraySettings Class
Autodesk.Revit.DB.Electrical Namespace